{
    "Empieza aquí": [
        {
            "type": "title",
            "content": "Bienvenidos al hackathon"
        },
        {
            "type": "paragraph",
            "title": "Qué encontrarán aquí: ",
            "content": "En esta sección de la página encontrarán toda la información que necesitan para idear, prototipar y enviar los avances de su idea."
        },
        {
            "type": "paragraph",
            "content": "Los invitamos a ver el siguiente vídeo, en donde uno de los expertos de nuestro equipo les dará a conocer cuál es el objetivo de este evento y los pasos que deberían seguir."
        },
        {
            "type": "paragraph",
            "content": "Pueden explorar el menú de la derecha para acceder a recursos de ideación y técnicos; con esta información podrán potenciar su proceso creativo y encontrarán recursos para hacer realidad sus ideas mediante el uso de programas de office 365, como: PowerApps, Automante, Azure y Teams. "
        },
        {
            "type": "video",
            "content": "https://www.youtube.com/embed/BmU4HMJcn9U"
        },
        {
            "type": "paragraph",
            "title": "Documento guía: ",
            "content": "A continuación, pueden dar clic en el botón “Descarga”, el cual los llevará a un archivo .PDF en el cual encontrarán información útil para acompañar todo el proceso del Hackathon, desde cómo generar ideas innovadoras para solucionar problemas cotidianos, hasta las plantillas que deben consultar para presentar su idea a los jurados."
        },
        {
            "type": "download",
            "content": "https://tmcycia0-my.sharepoint.com/:b:/g/personal/juanjose_murillo_critertec_com/ERYRRe5_K9RJnjCzJaBDr7ABesuh-Di5KOUGMXTn9l_VZw?e=1DzRVN"
        },
        {
            "type": "title",
            "content": "Fechas clave"
        },
        {
            "type": "paragraph",
            "title": "11 de junio: ",
            "content": "Hasta este día pueden realizar su registro oficial en la sección /Registro de esta página web. Recuerden que pueden hacer este proceso de manera grupal, en caso de que ya cuenten con un equipo, o de manera individual si desean ser asignados a un equipo de su universidad."
        },
        {
            "type": "paragraph",
            "title": "18 de junio: ",
            "content": "Este será el último día para que envíen la descripción de su idea. Consulten la página 39  a 42 de la guía para identificar la plantilla que deben completar y cómo enviarla a los jurados."
        },
        {
            "type": "paragraph",
            "content": "Como resultado de este proceso, escogeremos a los mejores equipos por cada universidad, quienes podrán avanzar a la siguiente fase de este proceso de creación."
        },
        {
            "type": "paragraph",
            "title": "23 de junio: ",
            "content": "Los equipos que superaron el filtro anterior tendrán plazo hasta este día para enviar un breve vídeo en donde describan el funcionamiento de su aplicación y el estado actual de su desarrollo. De esta fase pasarán 5 equipos, quienes tendrán la oportunidad de presentar al público sus ideas en la próxima etapa."
        },
        {
            "type": "paragraph",
            "content": "A los equipos que hayan llegado hasta aquí los invitamos a consultar las páginas 55 a 60 de a guía del hackathon, en donde encontrarán instrucciones y consejos para construir y compartir sus vídeos."
        },
        {
            "type": "paragraph",
            "title": "25 de junio: ",
            "content": "Este será el día de exposición de los finalistas, quienes tendrán la oportunidad de contarle al mundo sus ideas y porqué deberían ganar este Hackathon. Todos están invitados a participar y votar en este evento."
        },
        {
            "type": "paragraph",
            "content": "Con esta información están listos para iniciar, les deseamos mil éxitos en este proceso creativo. Están invitados a consultar el cronograma de eventos, en donde encontrarán espacios de formación para crear una aplicación desde cero e incluso conocer a expertos de la industria. ¡Nos vemos!."
        }
    ],
    "Diseña tu idea": [
        {
            "type": "title",
            "content": "Diseña tu idea"
        },
        {
            "type": "paragraph",
            "content": "Hemos preparado una serie de contenidos que les pueden ayudar a diseñar una aplicación innovadora y con el potencial de transformar su vida universitaria. En los siguientes vídeos encontrarán una serie de consejos para aprovechar al máximo el potencial de las plantillas de ideación que encontrarán en la guía del hackathon."
        },
        {
            "type": "paragraph",
            "title":"Descargar las plantillas de ideación: ",
            "content": "dando clic en el siguiente botón pueden descargar las plantillas de ideación que presentamos en la guía del hackathon. Les recomendamos imprimirlas y usarlas como una guía para construcción de sus ideas."
        },
        {
            "type": "download",
            "content": "https://tmcycia0-my.sharepoint.com/:b:/g/personal/juanjose_murillo_critertec_com/EcWDz1bp9gdHioAb_u8HcZcB4TUE_N3352fQNUjR-QSe7w?e=Z2skU0"
        },
        {
            "type": "video",
            "content": "https://www.youtube.com/embed/pJPgxIAzDmo"
        },
        {
            "type": "paragraph",
            "title":"Identificación e ideación: ",
            "content": "Para acompañar el proceso de identificar la problemática que pueden resolver e identificar las posibles soluciones innovadoras, pueden usar las plantillas 1 a la 6."
        },
        {
            "type": "video",
            "content": "https://www.youtube.com/embed/i-VA78K1FyM"
        },
        {
            "type": "paragraph",
            "title":"Prototipado: ",
            "content": "El proceso de prototipado puede ser acompañado por los recursos propuestos en las plantillas 7, 8 y 9."
        },
        {
            "type": "video",
            "content": "https://www.youtube.com/embed/iAhJj2GcZWI"
        },
        {
            "type": "paragraph",
            "title":"Comparte tu idea: ",
            "content": "En las últimas páginas de la guía del hackathon (que encontrarán en la sección “empieza aquí” de esta página, encontrarán una serie de consejos para grabar su idea en funcionamiento y compartirla con los jurados."
        }
    ],
    "PowerApps y Automate": [
        {
            "type": "title",
            "content": "Primeros pasos"
        },
        {
            "type": "paragraph",
            "content": "Power Apps es un conjunto de aplicaciones, servicios, conectores y plataformas de datos que proporcionan una oportunidad para crear aplicaciones personalizadas según las necesidades del usuario. Estas se conectan a los datos almacenados en varios orígenes de datos locales como SharePoint, Excel Office 365. "
        },
        {
            "type": "paragraph",
            "title": "Introducción a Power Apps:",
            "content": "Descubre el valor y las capacidades de Power Apps y cómo puedes aprovechar esta tecnología para crear aplicaciones sencillas."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/modules/introduction-power-apps/"
        },
        {
            "type": "paragraph",
            "title": "Personalización de una aplicación de lienzo en Power Apps:",
            "content": " aprende a personalizar una aplicación agregando controles, imágenes y lógica"
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/modules/customize-apps-in-powerapps/"
        },
        {
            "type": "paragraph",
            "title": "Crear una aplicación basada en modelos en Power Apps:",
            "content": " ¿Quieres crear aplicaciones rápidamente con poco o nada de código? Este contenido se centra en los bloques de creación de Dataverse y las aplicaciones basadas en modelos. Estos componentes clave te ayudarán a crear aplicaciones rápidas."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/create-app-models-business-processes/"
        },
        {
            "type": "paragraph",
            "title": "Uso de la interfaz de usuario y controles en una aplicación de lienzo en Power Apps:",
            "content": " La experiencia del usuario de la aplicación suele definir su éxito. Esta ruta de aprendizaje se centrará en cómo proporcionar la mejor navegación para tu idea y en cómo compilar la mejor interfaz de usuario con temas, iconos, imágenes y la personalización de colores y formas."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/ui-controls-canvas-app-powerapps/"
        },
        {
            "type": "paragraph",
            "title": "Uso de fórmulas básicas para conseguir mejores aplicaciones de lienzo de Power Apps:",
            "content": " ¿Quieres usar fórmulas para mejorar la funcionalidad y cambiar el comportamiento de una aplicación de lienzo de Power Apps? Con esta ruta de aprendizaje aprenderás a hacerlo."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/use-basic-formulas-powerapps-canvas-app/"
        },
        {
            "type": "paragraph",
            "title": "Automatizar un proceso empresarial con Power Automate:",
            "content": " Esta ruta de aprendizaje es una introducción a Power Automate, donde aprenderás a crear y administrar flujos de trabajo."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/use-basic-formulas-powerapps-canvas-app/"
        },
        {
            "type": "title",
            "content": "¿Buscas más información?"
        },
        {
            "type": "paragraph",
            "content": "Encuentra en el foro recursos adicionales y más avanzados para la creación de tu App "
        },
        {
            "type": "enlace",
            "content": "https://github.com/JuanjoMurillo/HackathonMicrosoft/discussions/7"
        }
    ],
    "Azure": [  
        {
            "type": "title",
            "content": "¿Dónde iniciar?"
        },
        {
            "type": "paragraph",
            "content": "Azure es un conjunto de servicios en la nube con los cuales es posible almacenar información y crear, administrar e implementar aplicaciones en la nube."
        },
        {
            "type": "paragraph",
            "content": "Con Azure puedes almacenar datos en la nube, crear máquinas virtuales para ejecutar aplicaciones empresariales como SQL Server, SAP y Oracle; también puedes crear escritorios virtuales para el teletrabajo e incluso crear aplicaciones web y API en la nube, entre otras funciones."
        },
        {
            "type": "paragraph",
            "title": "Aspectos básicos de Azure:",
            "content": " ¿Es tu primera experiencia desarrollando en la nube? Aquí encontrarás una serie de seis partes en la que se explican conceptos básicos sobre la nube, se proporciona una introducción simplificada a muchos servicios de Azure y se incluyen ejercicios prácticos para implementar un servicio por primera vez de forma gratuita."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/az-900-describe-cloud-concepts/"
        },
        {
            "type": "paragraph",
            "title": "Conceptos fundamentales de Azure:",
            "content": " ¿Estás interesado en la nube, pero no estás seguro de cómo puede ayudarle? En este módulo, descubrirás las ventajas de usar los servicios de informática en la nube y las diferencias entre los distintos tipos y categorías de informática en la nube."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/modules/fundamental-azure-concepts/"
        },
        {
            "type": "paragraph",
            "title": "Exploración de los conceptos de análisis de datos:",
            "content": " Obtén información sobre cómo ingerir datos sin procesar en un sistema de análisis de datos y a usar estos datos para crear modelos analíticos que te permitan obtener conclusiones significativas sobre tus servicios."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/modules/explore-concepts-of-data-analytics/"
        },
        {
            "type": "paragraph",
            "title": "Introducción a la inteligencia artificial en Azure:",
            "content": " La inteligencia artificial (IA) permite la creación de nuevas experiencias y soluciones increíbles, y Microsoft Azure proporciona servicios fáciles de usar que le ayudarán a empezar."
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/get-started-with-artificial-intelligence-on-azure/"
        },
        {
            "type": "title",
            "content": "¿Buscas más información?"
        },
        {
            "type": "paragraph",
            "content": "Si quieres explorar más de las posibilidades que ofrece Azure, te invitamos a visitar nuestro blog, en donde encontrarás cómo usar Azure para el reconocimiento de imágenes, lenguaje e incluso rostros. ¡Te esperamos!."
        },
        {
            "type": "enlace",
            "content": "https://github.com/JuanjoMurillo/HackathonMicrosoft/discussions/8"
        }
    ],
    "Apps integradas en Teams": [
        {
            "type": "title",
            "content": "Conecta tu aplicación a Teams"
        },
        {
            "type": "paragraph",
            "content": "Microsoft Teams es una Plataforma basada en la nube cuyo principal objetivo es la colaboración en equipo, mediante herramientas de mensajería y colaboración para optimizar procesos de comunicación y trabajo en equipo en tiempo real entre usuarios dentro y fuera de una organización."
        },
        {
            "type": "paragraph",
            "title": "Crear experiencias web integradas con pestañas para Microsoft Teams:",
            "content": " Microsoft Teams es una plataforma extensible en la que puedes crear aplicaciones personalizadas. Las aplicaciones para Microsoft Teams pueden ser tan simples o tan complejas como necesites, desde enviar notificaciones a canales o usuarios hasta aplicaciones multisuperficie complejas que incorporan bots de conversación, procesamiento de lenguaje natural y experiencias web incrustadas. Puedes crear aplicaciones para una persona, tu equipo, tu organización o para todos los usuarios de Microsoft Teams de todo el mundo. "
        },
        {
            "type": "enlace",
            "content": "https://docs.microsoft.com/es-es/learn/paths/m365-msteams-associate/"
        },
        {
            "type": "paragraph",
            "title": "Crea aplicaciones para llamadas:",
            "content": " Las reuniones son un elemento clave para mantener la productividad de las organizaciones y equipos, gracias a ellas se propicia la colaboración, el trabajo en equipo, la comunicación y la retroalimentación de una manera activa. Como creador de aplicaciones para llamadas podrás crear experiencias como tableros colaborativos, mensajes de bienvenida, encuestas al finalizar la aplicación o lo que necesites para solucionar la necesidad que hayas identificado."
        },
        {
            "type": "enlace",
            "content": "https://adoption.microsoft.com/extensibility-look-book/products/microsoft-teams/extensibility-meeting-apps"
        },
        {
            "type": "paragraph",
            "title": "Construye un bot en Teams:",
            "content": " Un Bot permite a los usuarios interactuar con tu aplicación mediante textos, módulos interactivos y tareas modulares. De acuerdo con la complejidad que desees explorar puedes programarlo para responder comandos de texto simple o conectarlo a servicios de inteligencia artificial con capacidad para procesar lenguaje natural. Recuerda que un Bot puede ser una aplicación por si mismo, o ser parte de un desarrollo aún mayor."
        },
        {
            "type": "enlace",
            "content": "https://adoption.microsoft.com/extensibility-look-book/products/microsoft-teams/extensibility-bot"
        }
        ,
        {
            "type": "title",
            "content": "Encuentra más en el foro"
        },
        {
            "type": "paragraph",
            "content": "Te invitamos a conocer todas las posibilidades que ofrece la integración de apicaciones a Microsoft Teams. Vista el foro y descubre cómo potenciar tu idea con esta información:"
        },
        {
            "type": "enlace",
            "content": "https://github.com/MicrosoftHackathon/ForoSoporte/discussions/10"
        }
    ]
}
